In [2]:
import pandas as pd

In [3]:
data={
    'ID' : [1,2,3,4,5,6],
    'Name' : ['Arya' , 'Aditya', 'Deepak', 'Tirthak', 'Riya', 'Vishakha'],
    'Age': [21,20,22,19,18,23],
    'Country':['UK', 'India' ,' USA', 'Australia', 'Canada', 'UK'],
    'Sales' : [200, 400, 300, 800, 150, 350]
}

In [5]:
df= pd.DataFrame(data)
print("Original Dataset:")
print(df)

Original Dataset:
   ID      Name  Age    Country  Sales
0   1      Arya   21         UK    200
1   2    Aditya   20      India    400
2   3    Deepak   22        USA    300
3   4   Tirthak   19  Australia    800
4   5      Riya   18     Canada    150
5   6  Vishakha   23         UK    350

In [6]:
#Data Flow Transformations

In [12]:
df['Name_Upper'] = df['Name'].str.upper()
print("\\nCharacter Map (Uppercase Names):")
print(df[['ID','Name','Name_Upper']])

\nCharacter Map (Uppercase Names):
   ID      Name Name_Upper
0   1      Arya       ARYA
1   2    Aditya     ADITYA
2   3    Deepak     DEEPAK
3   4   Tirthak    TIRTHAK
4   5      Riya       RIYA
5   6  Vishakha   VISHAKHA

In [13]:
df_copy1 = df.copy()
df_copy2 = df.copy()

df_copy1['Sales']*=1.1
df_copy2['Age'] +=5

print("\nMulticast (Modified Copies):")
print("Copy 1 (Sales Increased):")
print(df_copy1)
print("\nCopy 2 (Age Increased):")
print(df_copy2)

Multicast (Modified Copies):
Copy 1 (Sales Increased):
   ID      Name  Age    Country  Sales Name_Upper
0   1      Arya   21         UK  220.0       ARYA
1   2    Aditya   20      India  440.0     ADITYA
2   3    Deepak   22        USA  330.0     DEEPAK
3   4   Tirthak   19  Australia  880.0    TIRTHAK
4   5      Riya   18     Canada  165.0       RIYA
5   6  Vishakha   23         UK  385.0   VISHAKHA

Copy 2 (Age Increased):
   ID      Name  Age    Country  Sales Name_Upper
0   1      Arya   26         UK    200       ARYA
1   2    Aditya   25      India    400     ADITYA
2   3    Deepak   27        USA    300     DEEPAK
3   4   Tirthak   24  Australia    800    TIRTHAK
4   5      Riya   23     Canada    150       RIYA
5   6  Vishakha   28         UK    350   VISHAKHA

In [14]:
#Conditional Split : Sales>350
high_sales = df[df['Sales']>350]
low_sales = df[df['Sales']<=350]
print("\nConditinal Split:")
print("High Sales:")
print(high_sales)
print("\nLow Sales:")
print(low_sales)

Conditinal Split:
High Sales:
   ID     Name  Age    Country  Sales Name_Upper
1   2   Aditya   20      India    400     ADITYA
3   4  Tirthak   19  Australia    800    TIRTHAK

Low Sales:
   ID      Name  Age Country  Sales Name_Upper
0   1      Arya   21      UK    200       ARYA
2   3    Deepak   22     USA    300     DEEPAK
4   5      Riya   18  Canada    150       RIYA
5   6  Vishakha   23      UK    350   VISHAKHA

In [15]:
agg_df=df.groupby('Country')['Sales'].sum().reset_index()
print("\nAggregation (Total Sales by Country): ")
print(agg_df)

Aggregation (Total Sales by Country):
     Country  Sales
0        USA    300
1  Australia    800
2     Canada    150
3      India    400
4         UK    550

In [17]:
sorted_df=df.sort_values(by='Sales', ascending =False)
print("\nSort (Descending Sales): ")
print(sorted_df)

Sort (Descending Sales):
   ID      Name  Age    Country  Sales Name_Upper
3   4   Tirthak   19  Australia    800    TIRTHAK
1   2    Aditya   20      India    400     ADITYA
5   6  Vishakha   23         UK    350   VISHAKHA
2   3    Deepak   22        USA    300     DEEPAK
0   1      Arya   21         UK    200       ARYA
4   5      Riya   18     Canada    150       RIYA

In [20]:
df['Sales_Category'] =df['Sales'].apply(lambda x: 'High' if x> 300 else 'Low')
print("\nDerived Column (Sales Category): ")
print(df[['ID', 'Name' , 'Sales' , 'Sales_Category']])

Derived Column (Sales Category):
   ID      Name  Sales Sales_Category
0   1      Arya    200            Low
1   2    Aditya    400           High
2   3    Deepak    300            Low
3   4   Tirthak    800           High
4   5      Riya    150            Low
5   6  Vishakha    350           High